{
  "next_entry_id": 15,
  "entries": {
    "1": {
      "content": "In Pig Latin, for words starting with a consonant, move the first consonant or consonant cluster to the end of the word and add 'ay'. For words starting with a vowel, simply add 'way' at the end. Capitalization should be retained in the transformed output, meaning that the first letter of the original word should remain capitalized in the Pig Latin version if applicable.",
      "knowledge_type": "general"
    },
    "2": {
      "content": "When transforming words into Pig Latin, capitalization rules must be observed to retain the case of the initial letter from the original word in the transformed output, ensuring consistent transformation for capitalized words.",
      "knowledge_type": "positive"
    },
    "3": {
      "content": "In Pig Latin, capitalized words must retain their capitalization in the transformed output. The first letter of the original word should be capitalized in the Pig Latin version as well, e.g., 'Hello' becomes 'Ellohay'.",
      "knowledge_type": "positive"
    },
    "4": {
      "content": "When transforming words into Pig Latin, maintain the basis of the transformation by focusing only on the fundamental rules of consonants and vowels, regardless of affixes or grammatical forms.",
      "knowledge_type": "general"
    },
    "5": {
      "content": "In Pig Latin, the transformations should not take into account the original word's affixes or any grammatical forms, only the base form of the word.",
      "knowledge_type": "general"
    },
    "6": {
      "content": "In Pig Latin, if a word starts with a consonant that is capitalized, the transformed output must also retain that capitalization. For example, 'Python' transforms to 'Ythonpay'.",
      "knowledge_type": "positive"
    },
    "7": {
      "content": "In Pig Latin, if a word starts with a consonant that is capitalized, the transformed output must also retain that capitalization, ensuring the first letter is capitalized in the output as well.",
      "knowledge_type": "positive"
    },
    "8": {
      "content": "In Pig Latin, it is essential that capitalized words in the input maintain their capitalization after transformation, ensuring the first letter is capitalized in the output as well.",
      "knowledge_type": "positive"
    },
    "9": {
      "content": "In Pig Latin, a capitalized word's transformed output must maintain its original capitalization format, meaning the first letter of the original word must match the case after transformation.",
      "knowledge_type": "positive"
    },
    "10": {
      "content": "To convert words to Pig Latin, follow these rules: 1) If a word starts with a consonant, move the first consonant or consonant cluster to the end and add 'ay'. 2) If it starts with a vowel, simply add 'way' to the end. 3) Ensure that capitalization of the original word is retained in the transformed output, meaning if the original word starts with a capital letter, the transformed output should also start with a capital letter. This applies to both consonantal and vowel-starting words.",
      "knowledge_type": "positive"
    },
    "11": {
      "content": "Pig Latin transformation rules: For consonants, move the first consonant or consonant cluster to the end and add 'ay'. For vowels, simply add 'way'. Original capitalization must be retained in the transformation.",
      "knowledge_type": "general"
    },
    "12": {
      "content": "When transforming words into Pig Latin, ensure that the first letter retains its capitalization from the original word. For instance, 'Apple' becomes 'Appleway' instead of 'appleway'.",
      "knowledge_type": "positive"
    },
    "13": {
      "content": "Transformations into Pig Latin should maintain the original capitalization of the first letter to ensure readability and consistency in output.",
      "knowledge_type": "positive"
    },
    "14": {
      "content": "When transforming words into Pig Latin, it is essential to consider the word's starting letter. Consonant rules apply when the first letter is not a vowel (a, e, i, o, u), and the transformation should respect original capitalization.",
      "knowledge_type": "positive"
    }
  }
}